Sambulov/COS/Projects/DEMO/MIG/mig_gd32f450zi.c
/*
  Module Init Graph (MIG)
*/

#ifdef GD32F450

#include "app.h"

#define HDL_INTERRUPT_PRIO_GROUP_BITS   __NVIC_PRIO_BITS

#define HDL_HXTAL_CLOCK                   20000000
#define HDL_PLL_MUL_CLOCK                 mod_clock_hxtal  /* Can be clocked by: mod_clock_irc16m, mod_clock_hxtal */
#define HDL_SYS_CLOCK                     mod_clock_pll_p  /* Can be clocked by: mod_clock_pll_p, mod_clock_hxtal, mod_clock_irc16m */
#define HDL_PLL_VCO_PRESCALER             4                /* Can be 2, 3 .. 63 */
#define HDL_PLL_N_MULTIPLY                96               /* Note that, don`t excceed 500MHz; Can be 64, 65 .. 500 */ 
#define HDL_PLL_P_PRESCALER               2                /* Note that, don`t excceed 240MHz; Can be 2, 4, 6, 8 */
#define HDL_PLL_Q_PRESCALER               10               /* Note that, don`t excceed 48MHz; Can be 2, 3 .. 15 */
#define HDL_AHB_PRESCALER                 1                /* Note that, don`t excceed 200MHz; Can be 1, 2, 4, 8, 16, 64, 128, 256, 512 */
#define HDL_APB1_PRESCALER                4                /* Note that, don`t excceed 60MHz; Can be 1, 2, 4, 8, 16 */
#define HDL_APB2_PRESCALER                2                /* Note that, don`t excceed 120MHz; Can be 1, 2, 4, 8, 16 */

extern const void *_heap_start;
extern const void *_heap_size;

const hdl_mem_block_t hdl_heap_regions[] = {
  { &_heap_start, (uint32_t)&_heap_size },
  { NULL, 0 } /* Terminates the array. */  
};

const hdl_module_base_t hdl_null_module = {
  .iface = NULL,
  .dependencies = NULL,
  .config = NULL,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE)
};

const hdl_core_config_t mod_sys_core_cnf = {
  .phy = SCB_BASE,
  .flash_latency = WS_WSCNT_9
};

const hdl_core_arm_t mod_sys_core = {
  .iface = &hdl_core_arm_iface,
  .dependencies = NULL,
  .config = &mod_sys_core_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};
/***********************************************************
 *                          IRQ
***********************************************************/
hdl_interrupt_t mod_irq_systick = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_EXCEPTION_SysTick,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_timer0 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ25_TIMER0_UP_TIMER9,
    .priority = 0,
    .priority_group = 1
  )
};

hdl_interrupt_t mod_irq_timer1 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ28_TIMER1,
    .priority = 0,
    .priority_group = 2
  )
};

hdl_interrupt_t mod_irq_nmi = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_EXCEPTION_NonMaskableInt,
    .priority = 0,
    .priority_group = 2
  )
};

hdl_interrupt_t mod_irq_timer4 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ50_TIMER4,
    .priority = 0,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_i2c_0_ev = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ31_I2C0_EV,
    .priority = 0,
    .priority_group = 2
  )
};

hdl_interrupt_t mod_irq_i2c_0_err = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ32_I2C0_ER,
    .priority = 0,
    .priority_group = 2
  )
};

hdl_interrupt_t mod_irq_exti_4 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ10_EXTI4,
    .priority = 0,
    .priority_group = 1
  )
};

hdl_interrupt_t mod_irq_exti_5_9 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ23_EXTI5_9,
    .priority = 1,
    .priority_group = 0
  )
};

hdl_interrupt_t mod_irq_spi_3 = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ84_SPI3,
    .priority = 0,
    .priority_group = 2
  )
};

hdl_interrupt_t mod_irq_adc = {
  .irq_cnf = hdl_module_config(hdl_interrupt_config_t,
    .irq_type = HDL_NVIC_IRQ18_ADC,
    .priority = 0,
    .priority_group = 2
  )
};

/***********************************************************
 *                          NVIC
***********************************************************/
extern const hdl_nvic_config_t mod_nvic_cnf;

const void * const irq_vector[] __attribute__((aligned(HDL_VTOR_TAB_ALIGN))) = {
  &mod_nvic_cnf,
  &reset_handler,                           /* Vector 1 */
  &nmi_handler,                             /* Vector 2 IRQ -14 */
  &hard_fault_handler,                       /* Vector 3 IRQ -13 */
  &mem_manage_handler,                       /* Vector 4 IRQ -12 */
  &bus_fault_handler,                        /* Vector 5 IRQ -11 */
  &usage_fault_handler,                      /* Vector 6 IRQ -10 */
  (void *)NULL,                             /* Vector 7 IRQ -9 */
  (void *)NULL,                             /* Vector 8 IRQ -8 */
  (void *)NULL,                             /* Vector 9 IRQ -7 */
  (void *)NULL,                             /* Vector 10 IRQ -6 */
  &svc_handler,                             /* Vector 11 IRQ -5 */
  &debug_mon_handler,                        /* Vector 12 IRQ -4 */
  (void *)NULL,                             /* Vector 13 IRQ -3 */
  &pend_sv_handler,                          /* Vector 14 IRQ -2 */
  &systick_handler,                         /* Vector 15 IRQ -1 */
  /* Peripheral */
  &wwdgt_handler,                        /* Vector 16 IRQ 0 */
  &lvd_handler,                          /* Vector 17 IRQ 1 */
  &TAMPER_STAMP_IRQHandler,                 /* Vector 18 IRQ 2 */
  &RTC_WKUP_IRQHandler,                     /* Vector 19 IRQ 3 */
  &fmc_handler,                          /* Vector 20 IRQ 4 */
  &RCU_CTC_IRQHandler,                      /* Vector 21 IRQ 5 */
  &EXTI0_IRQHandler,                        /* Vector 22 IRQ 6 */
  &EXTI1_IRQHandler,                        /* Vector 23 IRQ 7 */
  &EXTI2_IRQHandler,                        /* Vector 24 IRQ 8 */
  &EXTI3_IRQHandler,                        /* Vector 25 IRQ 9 */
  &EXTI4_IRQHandler,                        /* Vector 26 IRQ 10 */
  &DMA0_Channel0_IRQHandler,                /* Vector 27 IRQ 11 */
  &DMA0_Channel1_IRQHandler,                /* Vector 28 IRQ 12 */
  &DMA0_Channel2_IRQHandler,                /* Vector 29 IRQ 13 */
  &DMA0_Channel3_IRQHandler,                /* Vector 30 IRQ 14 */
  &DMA0_Channel4_IRQHandler,                /* Vector 31 IRQ 15 */
  &DMA0_Channel5_IRQHandler,                /* Vector 32 IRQ 16 */
  &DMA0_Channel6_IRQHandler,                /* Vector 33 IRQ 17 */
  &ADC_IRQHandler,                          /* Vector 34 IRQ 18 */
  &CAN0_TX_IRQHandler,                      /* Vector 35 IRQ 19 */
  &CAN0_RX0_IRQHandler,                     /* Vector 36 IRQ 20 */
  &CAN0_RX1_IRQHandler,                     /* Vector 37 IRQ 21 */
  &CAN0_EWMC_IRQHandler,                    /* Vector 38 IRQ 22 */
  &EXTI5_9_IRQHandler,                      /* Vector 39 IRQ 23 */
  &TIMER0_BRK_TIMER8_IRQHandler,            /* Vector 40 IRQ 24 */
  &TIMER0_UP_TIMER9_IRQHandler,             /* Vector 41 IRQ 25 */
  &TIMER0_TRG_CMT_TIMER10_IRQHandler,       /* Vector 42 IRQ 26 */
  &timer0_channel_handler,               /* Vector 43 IRQ 27 */
  &TIMER1_IRQHandler,                       /* Vector 44 IRQ 28 */
  &timer2_handler,                       /* Vector 45 IRQ 29 */
  &TIMER3_IRQHandler,                       /* Vector 46 IRQ 30 */
  &i2c0_ev_handler,                      /* Vector 47 IRQ 31 */
  &i2c0_er_handler,                      /* Vector 48 IRQ 32 */
  &i2c1_ev_handler,                      /* Vector 49 IRQ 33 */
  &i2c1_er_handler,                      /* Vector 50 IRQ 34 */
  &spi0_handler,                         /* Vector 51 IRQ 35 */
  &spi1_handler,                         /* Vector 52 IRQ 36 */
  &usart0_handler,                       /* Vector 53 IRQ 37 */
  &usart1_handler,                       /* Vector 54 IRQ 38 */
  &USART2_IRQHandler,                       /* Vector 55 IRQ 39 */
  &EXTI10_15_IRQHandler,                    /* Vector 56 IRQ 40 */
  &RTC_Alarm_IRQHandler,                    /* Vector 57 IRQ 41 */
  &USBFS_WKUP_IRQHandler,                   /* Vector 58 IRQ 42 */
  &TIMER7_BRK_TIMER11_IRQHandler,           /* Vector 59 IRQ 43 */
  &TIMER7_UP_TIMER12_IRQHandler,            /* Vector 60 IRQ 44 */
  &TIMER7_TRG_CMT_TIMER13_IRQHandler,       /* Vector 61 IRQ 45 */
  &TIMER7_Channel_IRQHandler,               /* Vector 62 IRQ 46 */
  &DMA0_Channel7_IRQHandler,                /* Vector 63 IRQ 47 */
#if defined (GD32F450) || defined (GD32F470)
  &EXMC_IRQHandler,                         /* Vector 64 IRQ 48 */
  &SDIO_IRQHandler,                         /* Vector 65 IRQ 49 */
  &TIMER4_IRQHandler,                       /* Vector 66 IRQ 50 */
  &SPI2_IRQHandler,                         /* Vector 67 IRQ 51 */
  &UART3_IRQHandler,                        /* Vector 68 IRQ 52 */
  &UART4_IRQHandler,                        /* Vector 69 IRQ 53 */
  &TIMER5_DAC_IRQHandler,                   /* Vector 70 IRQ 54 */
  &TIMER6_IRQHandler,                       /* Vector 71 IRQ 55 */
  &DMA1_Channel0_IRQHandler,                /* Vector 72 IRQ 56 */
  &DMA1_Channel1_IRQHandler,                /* Vector 73 IRQ 57 */
  &DMA1_Channel2_IRQHandler,                /* Vector 74 IRQ 58 */
  &DMA1_Channel3_IRQHandler,                /* Vector 75 IRQ 59 */
  &DMA1_Channel4_IRQHandler,                /* Vector 76 IRQ 60 */
  &ENET_IRQHandler,                         /* Vector 77 IRQ 61 */
  &ENET_WKUP_IRQHandler,                    /* Vector 78 IRQ 62 */
  &CAN1_TX_IRQHandler,                      /* Vector 79 IRQ 63 */
  &CAN1_RX0_IRQHandler,                     /* Vector 80 IRQ 64 */
  &CAN1_RX1_IRQHandler,                     /* Vector 81 IRQ 65 */
  &CAN1_EWMC_IRQHandler,                    /* Vector 82 IRQ 66 */
  &USBFS_IRQHandler,                        /* Vector 83 IRQ 67 */
  &DMA1_Channel5_IRQHandler,                /* Vector 84 IRQ 68 */
  &DMA1_Channel6_IRQHandler,                /* Vector 85 IRQ 69 */
  &DMA1_Channel7_IRQHandler,                /* Vector 86 IRQ 70 */
  &USART5_IRQHandler,                       /* Vector 87 IRQ 71 */
  &I2C2_EV_IRQHandler,                      /* Vector 88 IRQ 72 */
  &I2C2_ER_IRQHandler,                      /* Vector 89 IRQ 73 */
  &USBHS_EP1_Out_IRQHandler,                /* Vector 90 IRQ 74 */
  &USBHS_EP1_In_IRQHandler,                 /* Vector 91 IRQ 75 */
  &USBHS_WKUP_IRQHandler,                   /* Vector 92 IRQ 76 */
  &USBHS_IRQHandler,                        /* Vector 93 IRQ 77 */
  &DCI_IRQHandler,                          /* Vector 94 IRQ 78 */
  &irq_n_handler,                           /* Vector 95 IRQ 79 */
  &TRNG_IRQHandler,                         /* Vector 96 IRQ 80 */
  &FPU_IRQHandler,                          /* Vector 97 IRQ 81 */
  &UART6_IRQHandler,                        /* Vector 98 IRQ 82 */
  &UART7_IRQHandler,                        /* Vector 99 IRQ 83 */
  &SPI3_IRQHandler,                         /* Vector 100 IRQ 84 */
  &SPI4_IRQHandler,                         /* Vector 101 IRQ 85 */
  &SPI5_IRQHandler,                         /* Vector 102 IRQ 86 */
  &irq_n_handler,                           /* Vector 103 IRQ 87 */
  &TLI_IRQHandler,                          /* Vector 104 IRQ 88 */
  &TLI_ER_IRQHandler,                       /* Vector 105 IRQ 89 */
  &IPA_IRQHandler,                          /* Vector 106 IRQ 90 */
#endif /* GD32F450_470 */
#if defined (GD32F405) || defined (GD32F425)
  &irq_n_handler,                           /* Vector 64 IRQ 48 */
  &SDIO_IRQHandler,                         /* Vector 65 IRQ 49 */
  &TIMER4_IRQHandler,                       /* Vector 66 IRQ 50 */
  &SPI2_IRQHandler,                         /* Vector 67 IRQ 51 */
  &UART3_IRQHandler,                        /* Vector 68 IRQ 52 */
  &UART4_IRQHandler,                        /* Vector 69 IRQ 53 */
  &TIMER5_DAC_IRQHandler,                   /* Vector 70 IRQ 54 */
  &TIMER6_IRQHandler,                       /* Vector 71 IRQ 55 */
  &DMA1_Channel0_IRQHandler,                /* Vector 72 IRQ 56 */
  &DMA1_Channel1_IRQHandler,                /* Vector 73 IRQ 57 */
  &DMA1_Channel2_IRQHandler,                /* Vector 74 IRQ 58 */
  &DMA1_Channel3_IRQHandler,                /* Vector 75 IRQ 59 */
  &DMA1_Channel4_IRQHandler,                /* Vector 76 IRQ 60 */
  &irq_n_handler,                           /* Vector 77 IRQ 61 */
  &irq_n_handler,                           /* Vector 78 IRQ 62 */
  &CAN1_TX_IRQHandler,                      /* Vector 79 IRQ 63 */
  &CAN1_RX0_IRQHandler,                     /* Vector 80 IRQ 64 */
  &CAN1_RX1_IRQHandler,                     /* Vector 81 IRQ 65 */
  &CAN1_EWMC_IRQHandler,                    /* Vector 82 IRQ 66 */
  &USBFS_IRQHandler,                        /* Vector 83 IRQ 67 */
  &DMA1_Channel5_IRQHandler,                /* Vector 84 IRQ 68 */
  &DMA1_Channel6_IRQHandler,                /* Vector 85 IRQ 69 */
  &DMA1_Channel7_IRQHandler,                /* Vector 86 IRQ 70 */
  &USART5_IRQHandler,                       /* Vector 87 IRQ 71 */
  &I2C2_EV_IRQHandler,                      /* Vector 88 IRQ 72 */
  &I2C2_ER_IRQHandler,                      /* Vector 89 IRQ 73 */
  &USBHS_EP1_Out_IRQHandler,                /* Vector 90 IRQ 74 */
  &USBHS_EP1_In_IRQHandler,                 /* Vector 91 IRQ 75 */
  &USBHS_WKUP_IRQHandler,                   /* Vector 92 IRQ 76 */
  &USBHS_IRQHandler,                        /* Vector 93 IRQ 77 */
  &DCI_IRQHandler,                          /* Vector 94 IRQ 78 */
  &irq_n_handler,                           /* Vector 95 IRQ 79 */
  &TRNG_IRQHandler,                         /* Vector 96 IRQ 80 */
  &FPU_IRQHandler,                          /* Vector 97 IRQ 81 */
  &irq_n_handler,                           /* Vector 98 IRQ 82 */
  &irq_n_handler,                           /* Vector 99 IRQ 83 */
  &irq_n_handler,                           /* Vector 100 IRQ 84 */
  &irq_n_handler,                           /* Vector 101 IRQ 85 */
  &irq_n_handler,                           /* Vector 102 IRQ 86 */
  &irq_n_handler,                           /* Vector 103 IRQ 87 */
  &irq_n_handler,                           /* Vector 104 IRQ 88 */
  &irq_n_handler,                           /* Vector 105 IRQ 89 */
  &irq_n_handler,                           /* Vector 106 IRQ 90 */
#endif /* GD32F405_425 */
#if defined (GD32F407) || defined (GD32F427)
  &EXMC_IRQHandler,                         /* Vector 64 IRQ 48 */
  &SDIO_IRQHandler,                         /* Vector 65 IRQ 49 */
  &TIMER4_IRQHandler,                       /* Vector 66 IRQ 50 */
  &SPI2_IRQHandler,                         /* Vector 67 IRQ 51 */
  &UART3_IRQHandler,                        /* Vector 68 IRQ 52 */
  &UART4_IRQHandler,                        /* Vector 69 IRQ 53 */
  &TIMER5_DAC_IRQHandler,                   /* Vector 70 IRQ 54 */
  &TIMER6_IRQHandler,                       /* Vector 71 IRQ 55 */
  &DMA1_Channel0_IRQHandler,                /* Vector 72 IRQ 56 */
  &DMA1_Channel1_IRQHandler,                /* Vector 73 IRQ 57 */
  &DMA1_Channel2_IRQHandler,                /* Vector 74 IRQ 58 */
  &DMA1_Channel3_IRQHandler,                /* Vector 75 IRQ 59 */
  &DMA1_Channel4_IRQHandler,                /* Vector 76 IRQ 60 */
  &ENET_IRQHandler,                         /* Vector 77 IRQ 61 */
  &ENET_WKUP_IRQHandler,                    /* Vector 78 IRQ 62 */
  &CAN1_TX_IRQHandler,                      /* Vector 79 IRQ 63 */
  &CAN1_RX0_IRQHandler,                     /* Vector 80 IRQ 64 */
  &CAN1_RX1_IRQHandler,                     /* Vector 81 IRQ 65 */
  &CAN1_EWMC_IRQHandler,                    /* Vector 82 IRQ 66 */
  &USBFS_IRQHandler,                        /* Vector 83 IRQ 67 */
  &DMA1_Channel5_IRQHandler,                /* Vector 84 IRQ 68 */
  &DMA1_Channel6_IRQHandler,                /* Vector 85 IRQ 69 */
  &DMA1_Channel7_IRQHandler,                /* Vector 86 IRQ 70 */
  &USART5_IRQHandler,                       /* Vector 87 IRQ 71 */
  &I2C2_EV_IRQHandler,                      /* Vector 88 IRQ 72 */
  &I2C2_ER_IRQHandler,                      /* Vector 89 IRQ 73 */
  &USBHS_EP1_Out_IRQHandler,                /* Vector 90 IRQ 74 */
  &USBHS_EP1_In_IRQHandler,                 /* Vector 91 IRQ 75 */
  &USBHS_WKUP_IRQHandler,                   /* Vector 92 IRQ 76 */
  &USBHS_IRQHandler,                        /* Vector 93 IRQ 77 */
  &DCI_IRQHandler,                          /* Vector 94 IRQ 78 */
  &irq_n_handler,                           /* Vector 95 IRQ 79 */
  &TRNG_IRQHandler,                         /* Vector 96 IRQ 80 */
  &FPU_IRQHandler,                          /* Vector 97 IRQ 81 */
  &irq_n_handler,                           /* Vector 98 IRQ 82 */
  &irq_n_handler,                           /* Vector 99 IRQ 83 */
  &irq_n_handler,                           /* Vector 100 IRQ 84 */
  &irq_n_handler,                           /* Vector 101 IRQ 85 */
  &irq_n_handler,                           /* Vector 102 IRQ 86 */
  &irq_n_handler,                           /* Vector 103 IRQ 87 */
  &irq_n_handler,                           /* Vector 104 IRQ 88 */
  &irq_n_handler,                           /* Vector 105 IRQ 89 */
  &IPA_IRQHandler,                          /* Vector 106 IRQ 90 */  
#endif /* GD32F407_427 */
  &irq_n_handler,                           /* Vector 107 IRQ 91 */
  &irq_n_handler,                           /* Vector 108 IRQ 92 */
  &irq_n_handler,                           /* Vector 109 IRQ 93 */
  &irq_n_handler,                           /* Vector 110 IRQ 94 */
  &irq_n_handler,                           /* Vector 111 IRQ 95 */
};

