Sambulov/COS/Projects/DEMO/MIG/mig_gd32f450zi.c
const hdl_nvic_config_t mod_nvic_cnf = {
  .vector = &irq_vector,
  .prio_bits = HDL_INTERRUPT_PRIO_GROUP_BITS,
  .interrupts = hdl_interrupts(&mod_irq_systick, &mod_irq_nmi, &mod_irq_exti_4, &mod_irq_spi_3, &mod_irq_adc,
                              &mod_irq_i2c_0_ev, &mod_irq_i2c_0_err, &mod_irq_exti_5_9, &mod_irq_timer4),
  .phy = NVIC
};

const hdl_nvic_t mod_nvic = {
  .iface = &hdl_nvic_iface,
  .dependencies = hdl_module_dependencies(&mod_sys_core),
  .config = &mod_nvic_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

/***********************************************************
 *                          EXTI
***********************************************************/

hdl_exti_t mod_nvic_exti_line_4 = {
  .line = HDL_EXTI_LINE_4,
  .mode = HDL_EXTI_MODE_INTERRUPT,
  .source = HDL_EXTI_SOURCE_PE,
  .trigger = HDL_EXTI_TRIGGER_RISING_FALLING,
};

hdl_exti_t mod_nvic_exti_line_5 = {
  .line = HDL_EXTI_LINE_5,
  .mode = HDL_EXTI_MODE_INTERRUPT,
  .source = HDL_EXTI_SOURCE_PD,
  .trigger = HDL_EXTI_TRIGGER_RISING_FALLING,
};

hdl_exti_controller_config_t mod_exti_cnf = {
  .extis = hdl_extis(&mod_nvic_exti_line_4, &mod_nvic_exti_line_5),
  .phy = EXTI
};

hdl_exti_controller_t mod_exti = {
  .iface = &hdl_exti_controller_iface,
  .dependencies = hdl_module_dependencies(&mod_nvic),
  .config = &mod_exti_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

/***********************************************************
 *                          CLOCK
***********************************************************/
const hdl_clock_mcu_t mod_clock_irc16m = {
  .iface = &hdl_clock_iface,
  .dependencies = NULL,
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_IRC16M, 
    .property.freq = 16000000,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_hxtal = {
  .iface = &hdl_clock_iface,
  .dependencies = NULL,
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_HXTAL, 
    .property.freq = HDL_HXTAL_CLOCK,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_pll_sel = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&HDL_PLL_MUL_CLOCK),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_PLL_SEL, 
    .property.div = HDL_PLL_VCO_PRESCALER,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_pll_vco = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_pll_sel),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_PLL_VCO,
    .property.mul = HDL_PLL_N_MULTIPLY,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_pll_p = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_pll_vco),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_PLL_P,
    .property.div = HDL_PLL_P_PRESCALER,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_pll_q = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_pll_vco),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_PLL_Q,
    .property.div = HDL_PLL_Q_PRESCALER,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_sys_clock = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_sys_core, &mod_clock_irc16m, &HDL_SYS_CLOCK),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_SYS_SEL,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_ahb = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_sys_clock),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_AHB,
    .property.div = HDL_AHB_PRESCALER,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_apb1 = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_APB1,
    .property.div = HDL_APB1_PRESCALER,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_apb2 = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_APB2,
    .property.div = HDL_APB2_PRESCALER,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_apb1_timers = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_apb1),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_APB1_TIMERS,
    .property.mul = 4,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_apb2_timers = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_apb2),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_APB2_TIMERS,
    .property.mul = 2,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

const hdl_clock_mcu_t mod_clock_adc = {
  .iface = &hdl_clock_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_apb2),
  .config = hdl_module_config(hdl_clock_config_t,
    .type = HDL_CLOCK_TYPE_ADC,
    .property.div = 8,
    .phy = RCU
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_CLOCK_VAR_SIZE)
};

/***********************************************************
 *                          COUNTER
***********************************************************/

const hdl_systick_counter_t mod_systick_counter = {
  .iface = &hdl_systick_counter_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = hdl_module_config(hdl_systick_counter_config_t,
    .phy = (uint32_t)SysTick,
    .period = 240000-1,
    .clock_src_mask = 0
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_tick_counter_t mod_timer0_counter = {
  .iface = &hdl_timertick_counter_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_apb2),
  .config = hdl_module_config(hdl_timertick_counter_config_t,
    .alignedmode = TIMER_COUNTER_EDGE,
    .clockdivision = TIMER_CKDIV_DIV1,
    .counterdirection = TIMER_COUNTER_UP,
    .period = 16000 - 1,
    .prescaler = 0,
    .repetitioncounter = 0,
    .rcu = RCU_TIMER0,
    .phy = TIMER0
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_timertick_counter_t mod_timer1_counter = {
  .iface = &hdl_timertick_counter_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_apb1),
  .config = hdl_module_config(hdl_timertick_counter_config_t,
    .alignedmode = TIMER_COUNTER_EDGE,
    .clockdivision = TIMER_CKDIV_DIV1,
    .counterdirection = TIMER_COUNTER_UP,
    .period = 16000 - 1,
    .prescaler = 0,
    .repetitioncounter = 0,
    .rcu = RCU_TIMER1,
    .phy = TIMER1
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_timertick_counter_t mod_timer4_counter = {
  .iface = &hdl_timertick_counter_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_apb1_timers),
  .config = hdl_module_config(hdl_timertick_counter_config_t,
    .alignedmode = TIMER_COUNTER_EDGE,
    .clockdivision = TIMER_CKDIV_DIV1,
    .counterdirection = TIMER_COUNTER_UP,
    .period = 0,
    .prescaler = 0,
    .repetitioncounter = 0,
    .rcu = RCU_TIMER4,
    .phy = TIMER4
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};
/***********************************************************
 *                          TIMER
 ***********************************************************/

const hdl_time_counter_config_t mod_systick_timer_cnf = {
  .reload_interrupt = &mod_irq_systick,
};

const hdl_time_counter_config_t mod_timer0_cnf = {
  .reload_interrupt = &mod_irq_timer0,
};

const hdl_time_counter_config_t mod_timer1_cnf = {
  .reload_interrupt = &mod_irq_timer1,
};

const hdl_time_counter_config_t mod_timer4_cnf = {
  .reload_interrupt = &mod_irq_timer4,
};

const hdl_time_counter_t mod_systick_timer = {
  .iface = &hdl_time_counter_iface,
  .dependencies = hdl_module_dependencies(&mod_systick_counter, &mod_nvic),
  .config = &mod_systick_timer_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_TIME_COUNTER_VAR_SIZE)
};

