Sambulov/COS/Projects/DEMO/MIG/mig_gd32f450zi.c
const hdl_time_counter_t mod_timer0 = {
  .iface = &hdl_time_counter_iface,
  .dependencies = hdl_module_dependencies(&mod_timer0_counter, &mod_nvic),
  .config = &mod_timer0_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_TIME_COUNTER_VAR_SIZE)
};

const hdl_time_counter_t mod_timer1 = {
  .iface = &hdl_time_counter_iface,
  .dependencies = hdl_module_dependencies(&mod_timer1_counter, &mod_nvic),
  .config = &mod_timer1_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_TIME_COUNTER_VAR_SIZE)
};

const hdl_timer_t mod_watchdog_timer = {
  .iface = &hdl_timer_iface,
  .config = hdl_module_config(hdl_timer_config_t,
    .mode = HDL_TIMER_MODE_IDLE,
    .delay = 0
  ),
  .dependencies = hdl_module_dependencies(&mod_systick_timer),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_TIMER_VAR_SIZE)
};


/***********************************************************
 *                          GPIO PORT
***********************************************************/
const hdl_gpio_port_config_t mod_gpio_port_config_a = {
  .rcu = RCU_GPIOA,
  .phy = GPIOA
};

const hdl_gpio_port_config_t mod_gpio_port_config_b = {
  .rcu = RCU_GPIOB,
  .phy = GPIOB
};

const hdl_gpio_port_config_t mod_gpio_port_config_c = {
  .rcu = RCU_GPIOC,
  .phy = GPIOC
};

const hdl_gpio_port_config_t mod_gpio_port_config_d = {
  .rcu = RCU_GPIOD,
  .phy = GPIOD
};

const hdl_gpio_port_config_t mod_gpio_port_config_e = {
  .rcu = RCU_GPIOE,
  .phy = GPIOE
};

const hdl_gpio_port_config_t mod_gpio_port_config_f = {
  .rcu = RCU_GPIOF,
  .phy = GPIOF
};

const hdl_gpio_port_config_t mod_gpio_port_config_g = {
  .rcu = RCU_GPIOG,
  .phy = GPIOG
};

const hdl_gpio_port_config_t mod_gpio_port_config_h = {
  .rcu = RCU_GPIOH,
  .phy = GPIOH
};

const hdl_gpio_port_config_t mod_gpio_port_config_i = {
  .rcu = RCU_GPIOI,
  .phy = GPIOI
};

const hdl_gpio_port_mcu_t hdl_gpio_port_a = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_gpio_port_config_a,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_gpio_port_mcu_t hdl_gpio_port_b = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_gpio_port_config_b,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_gpio_port_mcu_t hdl_gpio_port_c = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_gpio_port_config_c,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_gpio_port_mcu_t hdl_gpio_port_d = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_gpio_port_config_d,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_gpio_port_mcu_t hdl_gpio_port_e = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_gpio_port_config_e,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_gpio_port_mcu_t hdl_gpio_port_f = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_gpio_port_config_f,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_gpio_port_mcu_t hdl_gpio_port_g = {
  .iface = &hdl_gpio_port_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_gpio_port_config_g,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};
/***********************************************************
 *                          GPIO
***********************************************************/
const hdl_gpio_pin_hw_config_t hdl_gpio_mode_input_floating = {
  .type = GPIO_MODE_INPUT,
  .pull = GPIO_PUPD_NONE,
  .ospeed = GPIO_OSPEED_2MHZ,
  .af = GPIO_AF_0
};

const hdl_gpio_pin_hw_config_t hdl_gpio_mode_input_pu = {
  .type = GPIO_MODE_INPUT,
  .pull = GPIO_PUPD_PULLUP,
  .ospeed = GPIO_OSPEED_2MHZ,
  .af = GPIO_AF_0
};

const hdl_gpio_pin_hw_config_t hdl_gpio_mode_output_pp = {
  .type = GPIO_MODE_OUTPUT,
  .pull = GPIO_PUPD_NONE,
  .ospeed = GPIO_OSPEED_2MHZ,
  .otype = GPIO_OTYPE_PP,
  .af = GPIO_AF_0
};

const hdl_gpio_pin_hw_config_t hdl_gpio_mode_analog = {
  .type = GPIO_MODE_ANALOG,
  .pull = GPIO_PUPD_NONE,
  .ospeed = GPIO_OSPEED_2MHZ,
  .af = GPIO_AF_0
};

const hdl_gpio_pin_hw_config_t hdl_gpio_spi_mode = {
  .type = GPIO_MODE_AF,
  .pull = GPIO_PUPD_NONE,
  .ospeed = GPIO_OSPEED_MAX,
  .af = GPIO_AF_5,
  .otype = GPIO_OTYPE_PP,
};

const hdl_gpio_pin_hw_config_t mod_gpio_i2c_0_mode = {
  .af = GPIO_AF_4,
  .type = GPIO_MODE_AF,
  .otype = GPIO_OTYPE_OD,
  .ospeed = GPIO_OSPEED_2MHZ
};

const hdl_gpio_pin_t mod_gpio_pa0 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_0, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_analog
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PA0)

const hdl_gpio_pin_t mod_gpio_pa1 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_1, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_analog
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PA1)

const hdl_gpio_pin_t mod_gpio_pa2 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_2, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_analog
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PA2)

const hdl_gpio_pin_t mod_gpio_pa3 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_3, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_analog
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PA3)

const hdl_gpio_pin_t mod_gpio_pa4 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_4, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_analog
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PA4)

const hdl_gpio_pin_t mod_gpio_pa5 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_a),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_5, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_analog
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PA5)







const hdl_gpio_pin_t mod_gpio_pb0 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_0, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PB0)

const hdl_gpio_pin_t mod_gpio_pb6_scl = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_6, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &mod_gpio_i2c_0_mode
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PB6)

