Sambulov/COS/Projects/DEMO/MIG/mig_gd32f450zi.c
const hdl_gpio_pin_t mod_gpio_pb7_sda = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_b),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_7, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &mod_gpio_i2c_0_mode
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PB7)

const hdl_gpio_pin_t mod_gpio_pc0 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_0, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC0)

const hdl_gpio_pin_t mod_gpio_pc1 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_1, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC1)

const hdl_gpio_pin_t mod_gpio_pc2 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_2, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC2)

const hdl_gpio_pin_t mod_gpio_pc3 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_3, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC3)

const hdl_gpio_pin_t mod_gpio_pc4 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_4, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC4)

const hdl_gpio_pin_t mod_gpio_pc5 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_5, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC5)

const hdl_gpio_pin_t mod_gpio_pc6 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_6, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC6)

const hdl_gpio_pin_t mod_gpio_pc7 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_7, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC7)

const hdl_gpio_pin_t mod_gpio_pc8 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_8, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC8)

const hdl_gpio_pin_t mod_gpio_pc9 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_9, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC9)

const hdl_gpio_pin_t mod_gpio_pc10 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_10, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC10)

const hdl_gpio_pin_t mod_gpio_pc11 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_c),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_11, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PC11)

const hdl_gpio_pin_t mod_gpio_pd4 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_d),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_4, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PD4)

const hdl_gpio_pin_t mod_gpio_pd5 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_d),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_5, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PD5)

const hdl_gpio_pin_t mod_gpio_pd8 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_d),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_8, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PD8)

const hdl_gpio_pin_t mod_gpio_pd9 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_d),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_9, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PD9)

const hdl_gpio_pin_t mod_gpio_pd10 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_d),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_10, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PD10)

const hdl_gpio_pin_t mod_gpio_pd11 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_d),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_11, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PD11)

const hdl_gpio_pin_t mod_gpio_pd12 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_d),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_12, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PD12)

const hdl_gpio_pin_t mod_gpio_pe2_spi_sck = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_e),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_2, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_spi_mode
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PE2)

const hdl_gpio_pin_t mod_gpio_pe5_spi_miso = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_e),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_5, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_spi_mode
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PE5)

const hdl_gpio_pin_t mod_gpio_pe6_spi_mosi = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_e),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_6, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_spi_mode
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PE6)

const hdl_gpio_pin_t mod_gpio_pf3 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_3, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF3)

const hdl_gpio_pin_t mod_gpio_pf4 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_4, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF4)

const hdl_gpio_pin_t mod_gpio_pf6 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_6, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF6)

