Sambulov/COS/Projects/DEMO/MIG/mig_gd32f450zi.c
const hdl_gpio_pin_t mod_gpio_pf8 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_8, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF8)

const hdl_gpio_pin_t mod_gpio_pf10 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_10, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF10)

const hdl_gpio_pin_t mod_gpio_pf11 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_11, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF11)

const hdl_gpio_pin_t mod_gpio_pf12 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_12, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF12)

const hdl_gpio_pin_t mod_gpio_pf13 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_13, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF13)

const hdl_gpio_pin_t mod_gpio_pf14 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_14, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF14)

const hdl_gpio_pin_t mod_gpio_pf15 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_f),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_15, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PF15)

const hdl_gpio_pin_t mod_gpio_pg0 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_g),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_0, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PG0)

const hdl_gpio_pin_t mod_gpio_pg1 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_g),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_1, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PG1)

const hdl_gpio_pin_t mod_gpio_pg2 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_g),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_2, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PG2)

const hdl_gpio_pin_t mod_gpio_pg3 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_g),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_3, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_output_pp
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PG3)

const hdl_gpio_pin_t mod_gpio_pg4 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_g),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_4, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PG4)

const hdl_gpio_pin_t mod_gpio_pg5 = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_g),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_5, 
    .inactive_default = HDL_GPIO_LOW, 
    .hwc = &hdl_gpio_mode_input_floating
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PG5)


/***********************************************************
 *                          DMA
***********************************************************/
const hdl_dma_config_t mod_dma_config = {
  .rcu = RCU_DMA1,
  .phy = DMA1
};

hdl_dma_t mod_dma = {
  .iface = &hdl_dma_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_ahb),
  .config = &mod_dma_config,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_dma_channel_config_t mod_adc_dma_ch_config = {
  .priority = DMA_PRIORITY_LOW,
  .channel_periphery = DMA_SUBPERI0,
  .direction = DMA_PERIPH_TO_MEMORY,
  .memory_width = DMA_MEMORY_WIDTH_16BIT,
  .periph_width = DMA_PERIPH_WIDTH_16BIT,
  .memory_inc = 1,
  .periph_inc = 0,
  .circular = 1,
  .ch_no = DMA_CH0
};

const hdl_dma_channel_config_t mod_m2m_dma_ch_config = {
  .priority = DMA_PRIORITY_ULTRA_HIGH,
  .channel_periphery = DMA_SUBPERI0,
  .direction = DMA_MEMORY_TO_MEMORY,
  .memory_width = DMA_MEMORY_WIDTH_8BIT,
  .periph_width = DMA_PERIPH_WIDTH_8BIT,
  .memory_inc = 1,
  .periph_inc = 1,
  .circular = 0,
  .ch_no = DMA_CH1
};

hdl_dma_channel_t mod_adc_dma_ch = {
  .iface = &hdl_dma_channel_iface,
  .dependencies = hdl_module_dependencies(&mod_dma),
  .config = &mod_adc_dma_ch_config,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_dma_channel_config_t mod_dma_ch_spi_3_rx_config = {
  .priority = DMA_PRIORITY_MEDIUM,
  .channel_periphery = DMA_SUBPERI5,
  .direction = DMA_PERIPH_TO_MEMORY,
  .memory_width = DMA_MEMORY_WIDTH_8BIT,
  .periph_width = DMA_PERIPH_WIDTH_8BIT,
  .memory_inc = 1,
  .periph_inc = 0,
  .circular = 0,
  .ch_no = DMA_CH3
};

hdl_dma_channel_t mod_dma_ch_spi_3_rx = {
  .iface = &hdl_dma_channel_iface,
  .dependencies = hdl_module_dependencies(&mod_dma),
  .config = &mod_dma_ch_spi_3_rx_config,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

const hdl_dma_channel_config_t mod_dma_ch_spi_3_tx_config = {
  .priority = DMA_PRIORITY_MEDIUM,
  .channel_periphery = DMA_SUBPERI5,
  .direction = DMA_MEMORY_TO_PERIPH,
  .memory_width = DMA_MEMORY_WIDTH_8BIT,
  .periph_width = DMA_PERIPH_WIDTH_8BIT,
  .memory_inc = 1,
  .periph_inc = 0,
  .circular = 0,
  .ch_no = DMA_CH4
};

