Sambulov/COS/Projects/DEMO/MIG/mig_gd32f450zi.c
hdl_dma_channel_t mod_dma_ch_spi_3_tx = {
  .iface = &hdl_dma_channel_iface,
  .dependencies = hdl_module_dependencies(&mod_dma),
  .config = &mod_dma_ch_spi_3_tx_config,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

hdl_dma_channel_t mod_dma_ch_spi_3_m2m = {
  .iface = &hdl_dma_channel_iface,
  .dependencies = hdl_module_dependencies(&mod_dma),
  .config = &mod_m2m_dma_ch_config,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
};

/**************************************************************
 *                        ADC
 *************************************************************/
const hdl_adc_source_t mod_adc_source_0_adc_24v = {
  .channel = HDL_ADC_CHANNEL_0,
  .sample_time = HDL_ADC_SAMPLETIME_3,
};

const hdl_adc_source_t mod_adc_source_1_adc_24v_poe = {
  .channel = HDL_ADC_CHANNEL_1,
  .sample_time = HDL_ADC_SAMPLETIME_3,
};

const hdl_adc_source_t mod_adc_source_2_adc_5v = {
  .channel = HDL_ADC_CHANNEL_2,
  .sample_time = HDL_ADC_SAMPLETIME_3,
};

const hdl_adc_source_t mod_adc_source_3_adc_3v3 = {
  .channel = HDL_ADC_CHANNEL_3,
  .sample_time = HDL_ADC_SAMPLETIME_3,
};

const hdl_adc_source_t mod_adc_source_4_adc_2v5 = {
  .channel = HDL_ADC_CHANNEL_4,
  .sample_time = HDL_ADC_SAMPLETIME_3,
};

const hdl_adc_source_t mod_adc_source_5_adc_1v8 = {
  .channel = HDL_ADC_CHANNEL_5,
  .sample_time = HDL_ADC_SAMPLETIME_3,
};

const hdl_adc_config_t mod_adc_cnf = {
  .phy = ADC0,
  .adc_interrupt = &mod_irq_adc,
  .resolution = HDL_ADC_RESOLUTION_12BIT,
  .data_alignment = HDL_ADC_DATA_ALIGN_RIGHT,
  .init_timeout = 3000,
  .sources = hdl_adc_src(&mod_adc_source_0_adc_24v, &mod_adc_source_1_adc_24v_poe, &mod_adc_source_2_adc_5v,
                          &mod_adc_source_3_adc_3v3, &mod_adc_source_4_adc_2v5, &mod_adc_source_5_adc_1v8),
};

hdl_adc_mcu_t mod_adc = {
  .iface = &hdl_adc_iface,
  .dependencies = hdl_module_dependencies(&mod_clock_adc, &mod_systick_timer, &mod_adc_dma_ch, &mod_nvic),
  .config = &mod_adc_cnf,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_ADC_VAR_SIZE)
};

/**************************************************************
 *                        SPI
 *************************************************************/
const hdl_gpio_pin_t mod_gpio_pe6_spi_cs = {
  .iface = &hdl_gpio_pin_iface,
  .dependencies = hdl_module_dependencies(&hdl_gpio_port_e),
  .config = hdl_module_config(hdl_gpio_pin_config_t, 
    .pin = GPIO_PIN_4, 
    .inactive_default = HDL_GPIO_HIGH, 
    .hwc = &hdl_gpio_spi_mode
  ),
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
}; // (PE4)


const hdl_spi_server_config_t hdl_spi_slave_config = {
  .rcu = RCU_SPI3,
  .endian = HDL_SPI_ENDIAN_MSB,
  .polarity = SPI_CK_PL_LOW_PH_1EDGE,
  .spi_interrupt = &mod_irq_spi_3,
  .nss_interrupt = &mod_irq_exti_4,
  .phy = SPI3
};

const hdl_spi_server_dma_mcu_t mod_spi3_server_dma = {
  .iface = &hdl_spi_server_dma_iface,
  .dependencies = hdl_module_dependencies(&mod_gpio_pe6_spi_mosi, &mod_gpio_pe5_spi_miso, &mod_gpio_pe2_spi_sck,
                                          &mod_gpio_pe6_spi_cs, &mod_clock_apb2, &mod_nvic, 
                                          &mod_dma_ch_spi_3_rx, &mod_dma_ch_spi_3_tx, &mod_exti),
  .config = &hdl_spi_slave_config,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_SPI_SERVER_DMA_VAR_SIZE)
};

hdl_i2c_channel_t i2c1_ch0 = {.address = 0x23};

const hdl_i2c_config_t mod_i2c_0_config = {
  .channels = hdl_i2c_channels(&i2c1_ch0),
  .hwc = hdl_module_config(hdl_i2c_config_hw_t,
    .addr_10_bits = 0,
    .dtcy = I2C_DTCY_2,
    .dual_address = 0,
    .err_interrupt = &mod_irq_i2c_0_err,
    .ev_interrupt = &mod_irq_i2c_0_ev,
    .general_call_enable = 0,
    .speed = 400000,
    .stretch_enable = 1,
    .rcu = RCU_I2C0,
    .phy = I2C0
  )
};

hdl_i2c_mcu_t mod_i2c0 = {
  .iface = &hdl_i2c_iface,
  .dependencies = hdl_module_dependencies(&mod_gpio_pb6_scl, &mod_gpio_pb7_sda,
                                                 &mod_clock_apb1, &mod_nvic, &mod_systick_timer),
  .config = &mod_i2c_0_config,
  .mod_var = static_malloc(HDL_MODULE_VAR_SIZE),
  .obj_var = static_malloc(HDL_I2C_VAR_SIZE)
};

extern const hdl_interrupt_controller_t mod_ic                    __attribute__ ((alias ("mod_nvic")));

extern const hdl_tick_counter_t mod_tick_counter                  __attribute__ ((alias ("mod_systick_counter")));

extern const hdl_time_counter_t mod_timer_ms                      __attribute__ ((alias ("mod_systick_timer")));


extern const hdl_gpio_pin_t mod_output1_pin                       __attribute__ ((alias ("mod_gpio_pc0")));
extern const hdl_gpio_pin_t mod_output2_pin                       __attribute__ ((alias ("mod_gpio_pc1")));

extern const hdl_gpio_pin_t mod_led1_pin                          __attribute__ ((alias ("mod_gpio_pc5")));
extern const hdl_gpio_pin_t mod_led2_pin                          __attribute__ ((alias ("mod_gpio_pc6")));
extern const hdl_gpio_pin_t mod_led3_pin                          __attribute__ ((alias ("mod_gpio_pc7")));
extern const hdl_gpio_pin_t mod_led4_pin                          __attribute__ ((alias ("mod_gpio_pc8")));
extern const hdl_gpio_pin_t mod_button_pin                        __attribute__ ((alias ("mod_gpio_pf12")));

extern const hdl_uart_t mod_uart                                  __attribute__ ((alias ("hdl_null_module")));
extern const hdl_uart_t mod_rs485                                 __attribute__ ((alias ("hdl_null_module")));

extern const hdl_spi_client_ch_t mod_spi_client                   __attribute__ ((alias ("hdl_null_module")));

extern const hdl_i2c_t mod_i2c                                    __attribute__ ((alias ("hdl_null_module")));

#endif